In [1]:
#list of list
import pandas as pd

l1=[[11,22,33],[44,55,66],[77,88,99]]
df1=pd.DataFrame(l1)
df1

    0   1   2
0  11  22  33
1  44  55  66
2  77  88  99

In [2]:
#dict of list
d={
    'amzn':[300,400,500,600],
    'tsla':[122,567,897,456],
    'goog':[657,453,789,890],
}
df2=pd.DataFrame(d)
df2

   amzn  tsla  goog
0   300   122   657
1   400   567   453
2   500   897   789
3   600   456   890

In [3]:
#list of dict
d1=[{'open':100,'high':500,'low':789,'close':765},
    {'open':67,'high':789,'low':789,'close':765},
    {'open':100,'high':500,'low':789,'close':765}]
df3=pd.DataFrame(d1)
df3

   open  high  low  close
0   100   500  789    765
1    67   789  789    765
2   100   500  789    765

In [4]:
import numpy as np
np1=np.arange(25).reshape(5,5)
df4=pd.DataFrame(np1,columns=['c1','c2','c3','c4','c5'],index=['r1','r2','r3','r4','r5'])
df4

    c1  c2  c3  c4  c5
r1   0   1   2   3   4
r2   5   6   7   8   9
r3  10  11  12  13  14
r4  15  16  17  18  19
r5  20  21  22  23  24

In [5]:
df5=pd.read_csv('sp500.csv')
df5

                           Name                  Sector   Price    EPS
0                     Apple Inc  Information Technology  170.12   9.20
1                    Abbvie Inc             Health Care   93.29   5.31
2           Abbott Laboratories             Health Care   55.28   2.41
3                 Accenture Plc  Information Technology  145.30   5.91
4                  Allergan Plc             Health Care  171.81  15.42
..                          ...                     ...     ...    ...
97   Verizon Communications Inc      Telecommunications   45.85   3.75
98     Walgreens Boots Alliance        Consumer Staples   70.25   5.10
99        Wells Fargo & Company              Financials   54.02   4.14
100             Wal-Mart Stores        Consumer Staples   96.08   4.36
101            Exxon Mobil Corp                  Energy   80.31   3.56

[102 rows x 4 columns]

In [6]:
!pip install openpyxl

Requirement already satisfied: openpyxl in /Users/algo trading 2025/batch34/.venv/lib/python3.12/site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in /Users/algo trading 2025/batch34/.venv/lib/python3.12/site-packages (from openpyxl) (2.0.0)

In [7]:
df6=pd.read_excel('nov-9.xlsx')
df6

     name  age country
0  akshay   59   india
1    matt   36      uk

In [9]:
!pip install lxml

Collecting lxml
  Using cached lxml-6.0.2-cp312-cp312-macosx_10_13_universal2.whl.metadata (3.6 kB)
Using cached lxml-6.0.2-cp312-cp312-macosx_10_13_universal2.whl (8.7 MB)
Installing collected packages: lxml
Successfully installed lxml-6.0.2

In [10]:
pd.read_html('https://www.screener.in/screens/281185/nifty-50/')

[    S.No.              Name  CMP  Rs.      P/E  Mar Cap  Rs.Cr.  Div Yld  %  \
 0      1.  Reliance Industr   1478.00    26.10       2000098.90        0.37
 1      2.         HDFC Bank    982.30    20.87       1510452.61        1.12
 2      3.     Bharti Airtel   2001.20    37.27       1199997.51        0.80
 3      4.               TCS   2991.80    21.52       1082459.42        2.01
 4      5.        ICICI Bank   1343.00    18.01        959718.73        0.82
 5      6.               SBI    955.85    11.23        882308.58        1.66
 6      7.           Infosys   1476.80    21.81        613521.99        2.91
 7      8.    Life Insurance    924.15    11.44        584524.66        1.30
 8      9.    Hind. Unilever   2414.00    53.62        567191.33        1.78
 9     10.   Larsen & Toubro   3882.50    33.22        534069.27        0.88
 10    11.               ITC    404.05    25.09        506187.28        3.55
 11    12.     Maruti Suzuki  15479.00    32.93        486663.74        0.87
 12    13.             M & M   3690.20    32.24        458887.01        0.69
 13    14.   Kotak Mah. Bank   2088.30    22.36        415285.63        0.12
 14    15.  HCL Technologies   1512.40    24.18        410414.71        3.57
 15  S.No.              Name  CMP  Rs.      P/E  Mar Cap  Rs.Cr.  Div Yld  %
 16    16.  Sun Pharma.Inds.   1691.40    35.15        405823.52        0.95
 17    17.         Axis Bank   1222.80    14.60        379477.42        0.08
 18    18.    UltraTech Cem.  11849.00    47.60        349165.35        0.65
 19    19.     Titan Company   3769.30    81.04        334633.24        0.29
 20    20.              NTPC    326.10    13.31        316208.28        2.56
 21    21.       Adani Ports   1448.30    26.07        312852.92        0.48
 22    22.   Bharat Electron    414.25    53.16        302807.59        0.58
 23    23.       Eternal Ltd    306.10  1572.31        295593.54        0.00
 24    24.       Adani Power    151.48    24.28        292124.56        0.00
 25    25.         JSW Steel   1171.70    46.87        286533.84        0.24

     NP Qtr  Rs.Cr.  Qtr Profit Var  %  Sales Qtr  Rs.Cr.  Qtr Sales Var  %  \
 0         22092.00               9.67          254623.00              9.97
 1         20363.77              10.01           86993.84              4.81
 2          8650.80              65.11           52145.40             25.73
 3         12131.00               8.54           65799.00              2.40
 4         14318.15               3.16           48180.91              4.00
 5         21860.59              -4.25          128040.50              5.78
 6          7375.00              13.19           44490.00              8.55
 7         10095.92              30.66          241524.29              4.50
 8          2694.00              -2.14           16241.00              1.98
 9          4678.01              15.63           67983.53             10.44
 10         5186.55               2.91           19501.63             -2.44
 11         3349.00               7.95           42344.20             13.07
 12         3963.75              15.85           46105.67             21.57
 13         4468.27             -11.42           17198.74              4.70
 14         4236.00               0.00           31942.00             10.67
 15  NP Qtr  Rs.Cr.  Qtr Profit Var  %  Sales Qtr  Rs.Cr.  Qtr Sales Var  %
 16         3124.95               2.56           14478.31              8.93
 17         5566.56             -25.31           32309.77              2.24
 18         1237.98              75.23           19606.93             20.33
 19         1120.00              59.09           18725.00             28.84
 20         5225.30              -3.94           44785.82              0.18
 21         3120.20              25.07            9167.46             29.72
 22         1287.16              17.88            5792.09             25.78
 23           65.00             -63.07           13590.00            183.18
 24         2906.46             -11.38           13456.84              0.88
 25         1646.00             166.16           45152.00             13.78

     ROCE  %
 0      9.69
 1      7.51
 2     13.48
 3     64.63
 4      7.87
 5      6.47
 6     37.50
 7     53.13
 8     27.85
 9     14.49
 10    36.79
 11    21.70
 12    13.93
 13     8.17
 14    31.61
 15  ROCE  %
 16    20.21
 17     7.11
 18    10.89
 19    19.14
 20     9.95
 21    13.80
 22    38.88
 23     2.66
 24    22.54
 25     8.11  ]